In [1]:
import pandas as pd
nums = [10,20,30,40]

In [2]:
my_series =pd.Series(nums, index = ["A", "B", "C", "D"])

In [3]:
#to select data, select via indices:
my_series["A"]

np.int64(10)

In [4]:
#select by index
my_series.loc["B"]

np.int64(20)

In [5]:
#select by integer location
my_series.iloc[0]

np.int64(10)

In [6]:
### Dataframes

In [7]:
data = {"age": [34, 42, 27],
    "height": [1.78, 1.82, 1.75],
    "weight": [75, 80, 70]
}

In [8]:
df = pd.DataFrame(data)
df

   age  height  weight
0   34    1.78      75
1   42    1.82      80
2   27    1.75      70

In [9]:
df["age"]

0    34
1    42
2    27
Name: age, dtype: int64

In [10]:
df = pd.read_csv(r"C:\Users\Admin\Documents\Course Files\QADHPYTHON\data\loan_data.csv")

#show first two rows:

df[0:2:1] #also use [:2]

    ID  Income        Term  Balance  Debt  Score  Default
0  567   17500  Short Term     1460   272  225.0    False
1  523   18500   Long Term      890   970  187.0    False

In [11]:
df_ex = pd.read_excel(r"C:\Users\Admin\Documents\Course Files\QADHPYTHON\data\loan_data.xlsx", sheet_name = "March")

In [12]:
df_ex.head()

    ID  Income        Term  Balance  Debt  Score  Default
0  567   17500  Short Term     1460   272  225.0    False
1  523   18500   Long Term      890   970  187.0    False
2  544   20700  Short Term      880   884   85.0    False
3  370   21600  Short Term      920     0    NaN    False
4  756   24300  Short Term     1260     0  495.0    False

In [13]:
weather = pd.read_json(r"C:\Users\Admin\Documents\Course Files\QADHPYTHON\data\weather_data.json", convert_dates = False)

In [14]:
weather[0:11:1]
weather.dtypes

day          object
temp        float64
humidity    float64
sun_hrs     float64
dtype: object

In [15]:
import sqlite3

In [16]:
db_conn = sqlite3.connect("data/movies_db.sqlite")  
movies = pd.read_sql("SELECT * FROM movies", db_conn)  

print(movies)

   id                             name  year  rating
0   1  Who's Afraid of Virginia Woolf?  1966      10
1   2                           Zardoz  1974       6
2   3            2001: A Space Odyssey  1968       9

In [17]:
### exploring dataframes

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 856 entries, 0 to 855
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   ID       856 non-null    int64
 1   Income   856 non-null    int64
 2   Term     856 non-null    object
 3   Balance  856 non-null    int64
 4   Debt     856 non-null    int64
 5   Score    836 non-null    float64
 6   Default  856 non-null    bool
dtypes: bool(1), float64(1), int64(4), object(1)
memory usage: 41.1+ KB

In [19]:
df.describe().round(2)

            ID    Income  Balance      Debt    Score
count   856.00    856.00   856.00    856.00   836.00
mean    496.81  29882.01  1214.33    643.79   450.92
std     288.49  13976.26   587.76   1150.29   269.21
min       1.00  11800.00   140.00      0.00     0.00
25%     245.50  19800.00   910.00      0.00   242.75
50%     494.50  22900.00  1120.00     65.00   376.50
75%     747.25  39025.00  1370.00    958.75   647.25
max    1000.00  86000.00  6020.00  12891.00  1000.00

In [20]:
#changing type of column

df["ID"]= df["ID"].astype('string')

In [21]:
df.info

<bound method DataFrame.info of       ID  Income        Term  Balance  Debt  Score  Default
0    567   17500  Short Term     1460   272  225.0    False
1    523   18500   Long Term      890   970  187.0    False
2    544   20700  Short Term      880   884   85.0    False
3    370   21600  Short Term      920     0    NaN    False
4    756   24300  Short Term     1260     0  495.0    False
..   ...     ...         ...      ...   ...    ...      ...
851   71   30000   Long Term     1270  3779   52.0     True
852  932   42500   Long Term     1550     0  779.0    False
853   39   36400   Long Term     1830  3032  360.0     True
854  283   42200   Long Term     1500  2498  417.0    False
855  847   30800   Long Term     1190  2355  177.0     True

[856 rows x 7 columns]>

In [22]:
weather.info

<bound method DataFrame.info of           day   temp  humidity  sun_hrs
0  2023-07-15  15.68     73.18     6.40
1  2023-07-16  25.16     83.88     8.06
2  2023-07-17  13.26     80.05     4.89
3  2023-07-18  24.63     82.37     9.13
4  2023-07-19  12.78     83.10    17.10
5  2023-07-20  23.52     85.35     0.72
6  2023-07-21  17.80     85.64     5.79
7  2023-07-22  24.98     76.81    10.95
8  2023-07-23  23.48     80.86     3.77
9  2023-07-24  23.30     79.96    14.62>

In [23]:
### Indexing
df[["ID", "Balance"]]

      ID  Balance
0    567     1460
1    523      890
2    544      880
3    370      920
4    756     1260
..   ...      ...
851   71     1270
852  932     1550
853   39     1830
854  283     1500
855  847     1190

[856 rows x 2 columns]

In [24]:
df.loc[0, "ID"]

'567'

In [25]:
df.loc[0:10, "ID"]

0     567
1     523
2     544
3     370
4     756
5     929
6     373
7     818
8     284
9     621
10    404
Name: ID, dtype: string

In [26]:
df.loc[0:10:1, "ID":"Balance"]

     ID  Income        Term  Balance
0   567   17500  Short Term     1460
1   523   18500   Long Term      890
2   544   20700  Short Term      880
3   370   21600  Short Term      920
4   756   24300  Short Term     1260
5   929   22900   Long Term     1540
6   373   20400  Short Term     1200
7   818   24600  Short Term     1470
8   284   26500   Long Term      720
9   621   25400  Short Term     1130
10  404   19700  Short Term      910

In [27]:
df_sorted=df.sort_values(by="Balance", Reverse).copy()
df_sorted.head() #note the order is preserved so if you use loc, it won't necessarily return what you want since the index is differe --> use iloc

SyntaxError: positional argument follows keyword argument (1286778868.py, line 1)

In [ ]:
df_sorted.iloc[0:10, 0:4]

In [ ]:
### Querying

In [ ]:
df[(df["Balance"]>1000) & (df["Income"]<25000)]

In [ ]:
### Aggregating

In [ ]:
#work from columns you actually need
df[['Term', 'Balance']].groupby('Term').get_group("Short Term")

In [ ]:
df[['Term', 'Balance']].groupby('Term').mean()

In [ ]:
df[['Term', 'Default', 'Balance']].groupby(['Term', 'Default']).mean()

In [ ]:
df['Mean_Term_Debt'] = df[['Debt', 'Term']].groupby('Term').transform('mean')

In [ ]:
df

In [ ]:
### data cleaning with pandas

In [ ]:
#missing values

In [ ]:
import numpy as np
df = pd.DataFrame({
    'participant': [1,2,3,4],
    'age':[50, None, 30, np.nan],
    'satisfaction':[None, 8, 9, None]
})

In [ ]:
df.isna()

In [ ]:
df.isna().any()

In [ ]:
df.isna().sum()

In [ ]:
df.isna().any(axis=1)

In [ ]:
df[df.isna().any(axis=1)]

In [ ]:
df[~df.isna().any(axis=1)]

In [ ]:
df.dropna() # add inplace=True to save changes as state of dataframe

In [ ]:
df.dropna(thresh=2)

In [ ]:
df.dropna(subset=['age', 'satisfaction'], how = 'any')

In [ ]:
df.fillna(0) # an example

In [ ]:
df.fillna({'age':df['age'].mean(), 'satisfaction':df['satisfaction'].median})

In [ ]:
dupes = pd.read_csv(r"C:\Users\Admin\Documents\Course Files\QADHPYTHON\data\loan_data2.csv")

In [ ]:
dupes.info()

In [ ]:
dupes.duplicated().sum()

In [ ]:
dupes[dupes.duplicated()]

In [ ]:
dupes.drop_duplicates(inplace=True)  #equivalent to dupes = dupes.drop_duplicates()

In [ ]:
dupes

In [ ]:
##data transformations

In [ ]:
df = pd.read_csv(r"C:\Users\Admin\Documents\Course Files\QADHPYTHON\data\loan_data.csv")

In [ ]:
df.drop("ID", axis=1, inplace=True)

In [ ]:
df.drop(0)

In [ ]:
df['Net Assets']=df['Balance'] - df['Debt']

In [ ]:
df.replace({'Short Term':"6 Month", 'Long Term':"12 Month"}, regex = True) #so swapping short with 6 month so not including term

In [ ]:
def debtclassify(debt):
    if debt>1000:
        return "High"
    else:
        return "Low Debt"

In [ ]:
df["Debt"].map(debtclassify) # for a single point

In [ ]:
df['Debt'].map(lambda debt:'high' if debt > 1000 else 'Low') #applies function wihtout having to define function

In [ ]:
#apply works to entire column
df.select_dtypes('number').apply(lambda col: ((col - col.mean())/col.std()))